<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Tag extends Model
{
    /*------------------------------------------------------------------------**
    ** Entity 定義                                                            **
    **------------------------------------------------------------------------*/
    protected $table = 'tags';
    protected $fillable = [
        'name',            // tag名稱
        'frenquecy',       // 被使用次數
    ];

    /*------------------------------------------------------------------------**
    ** Relation 定義                                                          **
    **------------------------------------------------------------------------*/

    /**
     *  多篇文章 對 多個標籤
     *  中間表名稱慣例  aaa_bbbs 底線前後位由首字母排序，這裡是article_tags
     *  自動維護中間表的時間欄位.
     */
    public function articles()
    {
        return $this->belongsToMany(Article::class)->withTimestamps();
    }

    /*------------------------------------------------------------------------**
    ** 自訂函數方法                                                            **
    **------------------------------------------------------------------------*/
}
