<?php

namespace App\Articles;

use App\Core\Eloquent;

class Comment extends Eloquent
{
    /*------------------------------------------------------------------------**
    ** Entity 定義                                                            **
    **------------------------------------------------------------------------*/

    protected $table = 'comments';
    protected $fillable = [
        'content',          // 內容
        'status',           // 狀態
        'author',           // 回覆者
        'email',            // email
        'url',              // 此文章的url
        'article_id',          // 關聯至Article
    ];

    /*------------------------------------------------------------------------**
    ** Relation 定義                                                          **
    **------------------------------------------------------------------------*/

    /**
     * 回覆留言屬於文章.
     */
    public function article()
    {
        return $this->belongsTo(Article::class);
    }

    /*------------------------------------------------------------------------**
    ** 自訂功能函數                                                            **
    **------------------------------------------------------------------------*/
}
